# ===========================================================================================
# класифікатор продуктів відповідно до споживчого набору, додатковий файл до скріпту prices.R 
# ===========================================================================================

categories_list=c(
   ### хліб
   'хліб цільнозерновий', 'хліб пшеничний','хліб житньо-пшеничний','батон','багет',
   ### фрукти
   'апельсини', 'банани', 'яблука', 'авокадо', 'мандарини', 'виноград', 'лимони','ягоди', 'ківі', 'кавуни',
   ### овочі
   'буряк', 'кабачки', 'капуста білокачанна', 'картопля', 'морква', 'огірки', 'помідори', 'цибуля ріпчаста', 'часник', 'гриби', 'перець солодкий','баклажани','салати',
   ### М'ясо
   'свинина', 'свинина гуляш', 'свинина фарш', 'свинина ребра', 'яловичина', 'яловичина фарш', 'яловичина ребра','філе куряче', 'курка крильця', 'курка стегно',   'птиця (тушки курячі)','субпродукти яловичні','субпродукти свинячі',' субпродукти курячі','сало','вирізка свиняча',
   'вирізка яловича',
   ### Ковбаси
   'сосиски, сардельки вищого ґатунку', 'сосиски, сардельки першого ґатунку', 'ковбаси варені вищого ґатунку','ковбаси варені першого ґатунку', 'ковбаси сирокопчені в/ґ','ковбаси варено-копчені в/ґ',
   ### М'ясні делікатеси
   "вироби з м’яса делікатесні",
   ### Бакалія
   'пластівці вівсяні', 'рис', 'крупи гречані', 'борошно пшеничне', 'макарони', 'цукор', 'сухі сніданки', 'квасоля','пшоно','крупи манні','крупи ячні','супи',
   ### Молочка
   'молоко пастеризоване жирністю до 2,6% включно', 'йогурт', 'кефір 2.5%', 'сметана жирністю до 15% включно', 'сметана з підвищеним вмістом жиру',  'крем-сир', 'сири тверді типу Едам', 'сири м’які жирні', 'масло вершкове 82%', 'масло вершкове 73%', 'маргарин', 'молоко з підвищеним вмістом жиру', 'сири м’які нежирні', 'сири плавлені', 'сири розсольні','сирки та сиркова маса','молочні суміші для дитячого харчування',
   ### Риба
   'риба червона', 'риба річна', 'ікра червона', 'оселедці','скумбрія копчена', 'філе мороженої риби', 'риба морожена', 'консерви рибні в олії','морепродукти',
   ### Яйця
   'яйця', 
   ### Олія
   'олія соняшникова', 'олія оливкова', 
   ### Безалкогольні напої
   'сік яблучний', 'сік апельсиновий', 
   ### Кава і чай
   'кава розчинна', 'кава мелена', 'чай у пакетиках',
   ### Напівфабрикати
   'пельмені', 'вареники з картоплею',  'крабові палички', 
   ### Консерви
   'кукурудза консервована', 'горошок консервований','гриби консервовані',
   ### Морожені овочі
   'броколі заморожена', 'шпінат заморожений',
   ### Солодощі
   'печиво здобне', 'печиво затяжне','шоколад', 'цукати', 'вафлі','мед','зефір','морозиво','карамель','цукерки шоколадні', 'торти',
   ### Сухофрукти
   'сухофрукти',
   ### Безалкогольні напої
   'солодка вода',
   ### Алкоголь та цигарки
   'пиво', 'вино біле сухе', 'вино червоне сухе', 'горілка', 'ром', 'віскі', 'шампанське', 'коньяк', 
   ### Соуси
   'паста томатна', 'кетчуп томатний', 'майонез', 'сіль',
   ### Сигарети
   'сигарети з фільтром медіум класу', 'сигарети з фільтром преміум класу'
)


detect_product <- function(SECTION, PRODUCT) {
   ### Хліб
   `хліб цільнозерновий` = SECTION == "Хліб" & str_detect(PRODUCT, "цільнозерновий")
   `хліб пшеничний` = SECTION == "Хліб" & str_detect(PRODUCT, "пшеничн") & !str_detect(PRODUCT, "цільноз")  & !str_detect(PRODUCT, "житн")
   `хліб житньо-пшеничний` = SECTION == "Хліб" & str_detect(PRODUCT, "\\bжитн")
   `батон` = SECTION == "Хліб" & str_detect(PRODUCT, "(Б|б)атон")
   `багет` = SECTION == "Хліб" & str_detect(PRODUCT, "(Б|б)агет")
   
   ### фрукти
   `апельсини` =  SECTION == "Фрукти" & str_detect(PRODUCT, "(а|А)пельси(ни|н)\\b")
   `банани` = SECTION == "Фрукти" & str_detect(PRODUCT, "(Б|б)ана(ни|н)")
   `яблука` =  SECTION == "Фрукти" & str_detect(PRODUCT, "(Я|я)блук(а|о)\\b")
   `авокадо` = SECTION == "Фрукти" & str_detect(PRODUCT, "(А|а)вокадо\\b")
   `мандарини`= SECTION == "Фрукти" & str_detect(PRODUCT, "(М|м)андарин")
   `виноград`= SECTION == "Фрукти" & str_detect(PRODUCT, "(В|в)иноград")
   `лимони`= SECTION == "Фрукти" & str_detect(PRODUCT, "^(Л|л)имон")
   `ягоди`= SECTION == "Фрукти" & (str_detect(PRODUCT, "^(Л|л)охина") | 
                                      str_detect(PRODUCT, "^(М|м)алина") | 
                                      str_detect(PRODUCT, "^(П|п)олуниц")  | 
                                      str_detect(PRODUCT, "^(С|с)мородина")) & !str_detect(PRODUCT, "морожен")
   `ківі` = SECTION == "Фрукти" & str_detect(PRODUCT, "(К|к)іві") & !str_detect(PRODUCT, "сушен")
   `кавуни`= SECTION == "Фрукти" & str_detect(PRODUCT, "(К|к)авун")
   
   
   
   ### овочі
   `буряк` = SECTION == "Овочі" & str_detect(PRODUCT, "(Б|б)уряк\\b")
   `кабачки`  = SECTION == "Овочі" & str_detect(PRODUCT, "(К|к)абач(ки|ок)\\b")
   `капуста білокачанна` = SECTION == "Овочі" & str_detect(PRODUCT, "(К|к)апуста") & str_detect(PRODUCT, "білокачан")
   `картопля` = SECTION == "Овочі" & str_detect(PRODUCT, "(К|к)артопля")
   `морква` = SECTION == "Овочі" & str_detect(PRODUCT, "(М|м)орква")
   `огірки` = SECTION == "Овочі" & str_detect(PRODUCT, "(О|о)гірки")
   `помідори` = SECTION == "Овочі" & str_detect(PRODUCT, "(П|м)омідори")
   `цибуля ріпчаста` = SECTION == "Овочі" & str_detect(PRODUCT, "(Ц|ц)ибуля")
   `часник` = SECTION == "Овочі" & str_detect(PRODUCT, "(Ч|ч)асник")
   `гриби` = SECTION == "Гриби" & str_detect(PRODUCT, "(П|п)ечериці")
   `перець солодкий`= SECTION == "Овочі" & str_detect(PRODUCT, "(П|п)ерець") & (str_detect(PRODUCT, "(Ч|ч)ервоний") | str_detect(PRODUCT, "(К|к)апі") | str_detect(PRODUCT, "(Б|б)ілозірка") )
   `баклажани` = SECTION == "Овочі" & str_detect(PRODUCT, "(Б|б)аклажан")
   `салат` = SECTION == "Зелень" & str_detect(PRODUCT, "(С|с)алат")
   
   
   ### мʼясо
   `свинина` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(С|с)вин") & str_detect(PRODUCT, "без кістки")
   `свинина гуляш` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(С|с)вин") & str_detect(PRODUCT, "(Г|г)уляш")
   `свинина фарш` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(С|с)вин") & str_detect(PRODUCT, "(Ф|a)арш")
   `свинина ребра` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(С|с)вин") & str_detect(PRODUCT, "(Р|р)ебра")
   `яловичина` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(Я|я)лович") & (str_detect(PRODUCT, "без кістки") | str_detect(PRODUCT, "(Ф|ф)іле") | str_detect(PRODUCT, "(С|с)тейк"))
   `яловичина фарш` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(Я|я)лович") & str_detect(PRODUCT, "(Ф|a)арш")
   `яловичина ребра` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(Я|я)лович") & str_detect(PRODUCT, "(Р|р)ебра")
   `філе куряче` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(К|к)ур") & str_detect(PRODUCT, "(Ф|ф)іле")
   `курка крильця` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\b(К|к)ур") & str_detect(PRODUCT, "\\b(К|к)рил")
   `курка стегно` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\b(К|к)ур") & str_detect(PRODUCT, "(С|с)тегн")
   `птиця (тушки курячі)` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\b(К|к)ур") & str_detect(PRODUCT, "(Т|т)ушка")
   `субпродукти яловичі` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(Я|я)лович") & (str_detect(PRODUCT, "(Н|н)ирки") | str_detect(PRODUCT, "(П|п)ечінк")| str_detect(PRODUCT, "(Л|л)егені")|str_detect(PRODUCT, "(C|c)ерце"))
   `субпродукти свинячі` = SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(С|с)вин") & (str_detect(PRODUCT, "(Н|н)ирки") | str_detect(PRODUCT, "(П|п)ечінк")| str_detect(PRODUCT, "(Л|л)егені")|str_detect(PRODUCT, "(C|c)ерце"))
   `субпродукти курячі`= SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(К|к)ур(яч|ин)") & (str_detect(PRODUCT, "(Н|н)ирки") | str_detect(PRODUCT, "(П|п)ечінк")| str_detect(PRODUCT, "(Л|л)егені")|str_detect(PRODUCT, "(C|c)ерце"))
   `сало`= SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(С|с)ало")
   `вирізка свиняча`= SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(С|с)вин") & str_detect(PRODUCT, "\\b(В|в)ирізка")
   `вирізка яловича`= SECTION == "Свіже м’ясо" & str_detect(PRODUCT, "\\b(Я|я)лович") & str_detect(PRODUCT, "\\b(В|в)ирізка")
   
   ### Ковбаса та сосиски
   `сосиски в/ґ` = SECTION == "Ковбаса і сосиски" & (str_detect(PRODUCT, "(С|с)осиск") | str_detect(PRODUCT, "(С|с)ардель")) & (str_detect(PRODUCT, "в/(ґ|г)")| str_detect(PRODUCT, "вищ.*(ґ|г)ат"))
   `сосиски 1/ґ` = SECTION == "Ковбаса і сосиски" & (str_detect(PRODUCT, "(С|с)осиск") | str_detect(PRODUCT, "(С|с)ардель")) & str_detect(PRODUCT, "(перш|1/ґ)")
   `ковбаса варена в/ґ` = SECTION == "Ковбаса і сосиски" & str_detect(PRODUCT, "(К|к)овбаса.*варена") & str_detect(PRODUCT, "вищ.*(гат|сорт|ґатун)")
   `ковбаса варена 1/ґ` = SECTION == "Ковбаса і сосиски" & str_detect(PRODUCT, "(К|к)овбаса.*варена") & str_detect(PRODUCT, "(перш|1/ґ)")
   `ковбаси сирокопчені в/ґ`= SECTION == "Ковбаса і сосиски" & str_detect(PRODUCT, "(С|с)ирокопчен") & str_detect(PRODUCT, "(вищ|в/ґ)")
   `ковбаси варено-копчені в/ґ` = SECTION == "Ковбаса і сосиски" & str_detect(PRODUCT, "(варен)") & str_detect(PRODUCT, "копчен")
   
   ### вироби з м’яса делікатесні
   `вироби з м’яса делікатесні` = SECTION == "М'ясні делікатеси" #& (str_detect(PRODUCT, "(Б|б)екон")|str_detect(PRODUCT, "(Х|х)амон")|str_detect(PRODUCT, "(Б|б)астурма"))
   
   ### Бакалія
   `пластівці вівсяні` = SECTION == "Крупи" & str_detect(PRODUCT, "(В|в)івсян")
   # `рис` = SECTION == "Крупи" & str_detect(PRODUCT, "(Р|р)ис\\b") & str_detect(PRODUCT, "довгозернист") & str_detect(PRODUCT, "шліфов")
   `рис` = SECTION == "Крупи" & str_detect(PRODUCT, "(Р|р)ис\\b")
   `крупи гречані` = SECTION == "Крупи" & str_detect(PRODUCT, "(Г|г)реч")
   `борошно пшеничне` = SECTION == "Борошно" & str_detect(PRODUCT, "(Б|б)орошно.*пшени") 
   `макарони` = SECTION == "Макарони" & str_detect(PRODUCT, "(М|м)акарони")
   `цукор` = SECTION == "Цукор та цукрозамінники" & str_detect(PRODUCT, "(Ц|у)кор.*білий") 
   `сухі сніданки` = SECTION == "Cухі сніданки"
   `квасоля` = SECTION == "Крупи" & str_detect(PRODUCT, "(К|к)васоля")
   `пшоно`= SECTION == "Крупи" & str_detect(PRODUCT, "(П|п)шоно")
   `крупи манні`= SECTION == "Крупи" & str_detect(PRODUCT, "(М|м)анна")
   `крупи ячні`= SECTION == "Крупи" & str_detect(PRODUCT, "(Я|я)чна")
   `суп`= SECTION == "Їжа швидкого приготування" & str_detect(PRODUCT, "\\b(С|с)уп\\b")
   
   
   ### Молочка
   `молоко пастеризоване жирністю до 2,6% включно` = SECTION == "Молоко" & str_detect(PRODUCT, "ультрапастеризоване.*2(.|,)5%") 
   `йогурт` = SECTION == "Йогурт" & str_detect(PRODUCT, "Йогурт") & !str_detect(PRODUCT, "(К|к)окосовий") & !str_detect(PRODUCT, "(С|с)оєвий")
   `кефір` = SECTION == "Кисломолочні напої" & str_detect(PRODUCT, "(К|к)ефір") & str_detect(PRODUCT, "2(.|,)5%")
   `сметана жирністю до 15% включно` = SECTION == "Сметана" & str_detect(PRODUCT, "(С|с)метана.*(10|15)%")
   `сметана з підвищеним вмістом жиру` = SECTION == "Сметана" & str_detect(PRODUCT, "(С|с)метана.*(2[\\d]|3[\\d])%")
   `крем-сир` = SECTION == "Сир" & str_detect(PRODUCT, "(К|к)рем-сир")
   `сири тверді типу Едам` = SECTION == "Сир" & str_detect(PRODUCT, "(С|с)сир") & (str_detect(PRODUCT, "\\bЕдам")|str_detect(PRODUCT, "\\bЧеддер")|str_detect(PRODUCT, "\\bГауда")) & !str_detect(PRODUCT, "плавлений")
   # `сири тверді типу Емменталь` = SECTION == "Сир" & str_detect(PRODUCT, "(С|с)сир") & str_detect(PRODUCT, "\\bтвердий")
   `сири м’які жирні` = SECTION == "Сир кисломолочний" & str_detect(PRODUCT, "кисломолоч") & str_detect(PRODUCT, "[6-9][0-9]{0,1},{0,1}[\\d]{0,1}%")
   `масло вершкове 82%` = SECTION == "Масло і маргарин" & str_detect(PRODUCT, "(М|м)асло.*вершкове.*82.*%")
   `масло вершкове спред` = SECTION == "Масло і маргарин" & str_detect(PRODUCT, "(М|м)асло.*7[\\d][,.]{0,1}[\\d]{0,1}%")
   `маргарин` = SECTION == "Масло і маргарин" & str_detect(PRODUCT, "(М|м)аргарин\\b.*7.*%")
   `молоко з підвищеним вмістом жиру` = SECTION == "Молоко" & str_detect(PRODUCT, "ультрапастеризоване.*3(.|,)[\\d]%") 
   `сири м’які нежирні` = SECTION == "Сир кисломолочний" & str_detect(PRODUCT, "кисломолоч") & str_detect(PRODUCT, "[0-5],{0,1}[\\d]{0,1}%")
   `сири плавлені` = SECTION == "Сир" & str_detect(PRODUCT, "Сир.*плавлений")
   `сири розсольні` = SECTION == "Сир" & (str_detect(PRODUCT, "(М|м)оцаре")| str_detect(PRODUCT, "(С|с)улугун")| str_detect(PRODUCT, "(Ф|ф)ета")| str_detect(PRODUCT, "(Б|б)ринза"))
   `сирки та сиркова маса`= SECTION == "Сир кисломолочний" & (str_detect(PRODUCT, "(М|м)аса") | str_detect(PRODUCT, "(С|с)ирок"))
   `молочні суміші для дитячого харчування` = SECTION == "Харчування" & str_detect(PRODUCT, "(М|м)олочна суміш") 
   
   ### риба
   `риба червона філе` = SECTION == "Свіжа риба" & (str_detect(PRODUCT, "(Л|л)осось") | str_detect(PRODUCT, "(С|с)ьомга") | str_detect(PRODUCT, "(Ф|ф)орель")) & str_detect(PRODUCT, "((Ф|ф)іле|(С|с)тейк|\\bціл)")
   `риба річна` = SECTION == "Свіжа риба" & (str_detect(PRODUCT, "(Т|т)овстолоб") | str_detect(PRODUCT, "(К|к)ороп"))
   `ікра червона` = SECTION == "Морепродукти" & str_detect(PRODUCT, "(І|і)кра.*лосос") & !str_detect(PRODUCT, "білкова") & !str_detect(PRODUCT, "імітован")
   `оселедці` = SECTION == "Приготована риба" & str_detect(PRODUCT, "(О|о)селедець")
   `скумбрія копчена` = SECTION == "Приготована риба" & str_detect(PRODUCT, "(С|с)кумбрія") & str_detect(PRODUCT, "копчен")
   `філе мороженої риби` = SECTION == "Риба" & str_detect(PRODUCT, "(Ф|ф)іле") & str_detect(PRODUCT, "мороже")
   `риба морожена` = SECTION == "Риба" & str_detect(PRODUCT, "мороже") & !str_detect(PRODUCT, "(Ф|ф)іле") & !str_detect(PRODUCT, "(Ф|ф)арш")
   `консерви рибні в олії`= SECTION == "Консервоване м'ясо і риба" & str_detect(PRODUCT, "в олії")
   `морепродукти`= SECTION == "Морепродукти" & !str_detect(PRODUCT, "(І|і)кра") & !str_detect(PRODUCT, "(К|к)раб.*палич")
   
   ### Яйця
   `яйця курячі` = SECTION == "Яйця" & str_detect(PRODUCT, "куряч")
   
   ### Олія
   `олія соняшникова` = SECTION == "Олія" & str_detect(PRODUCT, "соняшник")
   `олія оливкова` = SECTION == "Олія" & str_detect(PRODUCT, "оливкова")
   
   ### Безалкогольні напої
   `сік яблучний` = SECTION == "Сік" & str_detect(PRODUCT, " (Я|я)блучний")
   `сік апельсиновий` = SECTION == "Сік" & str_detect(PRODUCT, " (А|а)пельсиновий")
   
   ### Кава і чай
   `кава розчинна` = SECTION == "Кава" & str_detect(PRODUCT, "розчинна") & !str_detect(PRODUCT, "3в1")
   `кава мелена` = SECTION == "Кава" & str_detect(PRODUCT, "мелена")
   `чай у пакетиках` = SECTION == "Чай" & str_detect(PRODUCT, "пакетиках") & str_detect(PRODUCT, "25")
   
   ### Напівфабрикати
   `пельмені` = SECTION == "Напівфібрикати" & str_detect(PRODUCT, "Пельмені")
   `вареники` =  SECTION == "Напівфібрикати" & str_detect(PRODUCT, "(В|в)ареники") & str_detect(PRODUCT, "(К|к)артоп")
   `крабові палички` = SECTION == "Напівфібрикати" & str_detect(PRODUCT, "(К|к)рабові")& str_detect(PRODUCT, "(П|п)алички") 
   
   ### Консерви
   `кукурудза консервована` = SECTION == "Консервовані фрукти і овочі" & str_detect(PRODUCT, "(К|к)укурудза")
   `горошок консервований` = SECTION == "Консервовані фрукти і овочі" & str_detect(PRODUCT, "(Г|г)орошок")
   `гриби консервовані` = SECTION == "Консервовані фрукти і овочі" & (str_detect(PRODUCT, "(Г|г)риби")| str_detect(PRODUCT, "(Ш|ш)амп") | str_detect(PRODUCT, "(М|м)аслюки"))
   
   ### Заморожені овочі
   `броколі заморожена` = SECTION == "Овочі та гриби" & str_detect(PRODUCT, "(Б|б)роколі") & str_detect(PRODUCT, "(З|з)аморож")
   `шпінат заморожений` = SECTION == "Овочі та гриби" & str_detect(PRODUCT, "(Ш|ш)пінат") & str_detect(PRODUCT, "(З|з)аморож")
   
   ### Солодощі
   `печиво здобне` = SECTION == "Печиво, кекси, тістечка" & str_detect(PRODUCT, "(П|п)ечиво") & str_detect(PRODUCT, "(З|з)добне")
   `печиво затяжне` = SECTION == "Печиво, кекси, тістечка" & str_detect(PRODUCT, "(П|п)ечиво") & str_detect(PRODUCT, "(З|з)атяжне")
   `шоколад` = SECTION == "Шоколад в плитках" & str_detect(PRODUCT, "(Ш|ш)околад")
   `цукати`= SECTION == "Сухофрукти" & str_detect(PRODUCT, "(Ц|ц)укати")
   `вафлі` = SECTION == "Печиво, кекси, тістечка" & str_detect(PRODUCT, "(В|в)афлі")
   `мед`= (SECTION == "Фермерські продукти" | SECTION == "Джем і мед") & str_detect(PRODUCT, "^Мед\\b")
   `зефір` = SECTION == "Кондитерські вироби" & str_detect(PRODUCT, "(З|з)ефір")
   `морозиво` = str_detect(PRODUCT, "(М|м)орозиво")
   `карамель` = SECTION == "Кондитерські вироби" & str_detect(PRODUCT, "(К|к)арамель")
   `цукерки шоколадні` = SECTION == "Кондитерські вироби" & str_detect(PRODUCT, "(Ц|ц)укерки") & str_detect(PRODUCT, "(Ш|ш)околадні")
   `торти` = SECTION == "Торти і тістечка" & str_detect(PRODUCT, "(Т|т)орт\\b")
   
   # 
   
   ### Сухофрукти
   `сухофрукти` = SECTION == "Сухофрукти" & (str_detect(PRODUCT, "(К|к)урага")| 
                                                str_detect(PRODUCT, "(А|а)брикос")| 
                                                str_detect(PRODUCT, "(Ч|ч)орнослив")| 
                                                str_detect(PRODUCT, "(Р|р)одзинки")| 
                                                str_detect(PRODUCT, "(Ж|ж)уравлина")
   )
   ### Безалкогольні напої
   `солодка вода` = SECTION == "Солодка вода"
   
   ### Алкоголь та цигарки
   `пиво` = str_detect(PRODUCT, "(п|П)иво")
   `вино біле сухе` = str_detect(PRODUCT, "(В|в)ино") & str_detect(PRODUCT, "\\bсухе") & str_detect(PRODUCT, "біле")
   `вино червоне сухе` = str_detect(PRODUCT, "(В|в)ино") & str_detect(PRODUCT, "\\bсухе") & str_detect(PRODUCT, "червоне")
   `горілка` = str_detect(PRODUCT, "(г|Г)орілка")
   `ром` = str_detect(PRODUCT, "\\b(р|Р)ом\\b")
   `віскі` = str_detect(PRODUCT, "(в|В)іскі")
   `шампанське` = str_detect(PRODUCT, "(Ш|ш)ампанське")
   `коньяк` = str_detect(PRODUCT, "(К|к)оньяк")
 
   
   ### Соуси
   `томатна паста` = SECTION == "Соус" & str_detect(PRODUCT, "(Т|т)оматна") & str_detect(PRODUCT, "(П|п)аста")
   `кетчуп томатний`= SECTION == "Кетчуп" 
   `майонез`= SECTION == "Майонез" 
   `сіль`= str_detect(PRODUCT, "\\b(С|с)іль\\b")
   
   ### Сигарети
   `сигарети з фільтром медіум класу` = SECTION == "Цигарки" & str_detect(PRODUCT, "Bond|L&M|Winston") 
   `сигарети з фільтром преміум класу` = SECTION == "Цигарки" & str_detect(PRODUCT, "Kent|Camel з фільтром") 
   
   # тут усе повинно бути в тому самому порядку що і у religions_list
   vector = str_c(sep=",", 
                  ### Хліб
                  `хліб цільнозерновий`,`хліб пшеничний`,`хліб житньо-пшеничний`,`батон`,`багет`,
                  
                  ### Фрукти
                  `апельсини`, `банани`, `яблука`, `авокадо`, `мандарини`, `виноград`,`лимони`,`ягоди`,`ківі`,`кавуни`,
                  
                  ### Овочі
                  `буряк`, `кабачки`, `капуста білокачанна`, `картопля`, `морква`, `огірки`, `помідори`, `цибуля ріпчаста`, `часник`, `гриби`,`перець солодкий`,`баклажани`,`салат`,
                  
                  ### Мʼясо
                  `свинина`, `свинина гуляш`, `свинина фарш`, `свинина ребра`, `яловичина`, `яловичина фарш`, `яловичина ребра`, 
                  `філе куряче`, `курка крильця`, `курка стегно`,`птиця (тушки курячі)`,`субпродукти яловичі`,`субпродукти свинячі`,`субпродукти курячі`,`сало`,`вирізка свиняча`,
                  `вирізка яловича`,
                  
                  ### Ковбаси
                  `сосиски в/ґ`,`сосиски 1/ґ`, `ковбаса варена в/ґ`,`ковбаса варена 1/ґ`,`ковбаси сирокопчені в/ґ`,`ковбаси варено-копчені в/ґ`,
                  
                  ### Мʼясні делікатеси
                  `вироби з м’яса делікатесні`,
                  
                  ### Бакалія
                  `пластівці вівсяні`, `рис`, `крупи гречані`, `борошно пшеничне`,`макарони`,`цукор`, `сухі сніданки`, `квасоля`,`пшоно`,`крупи манні`,`крупи ячні`,`суп`,
                  
                  ### Молочка
                  `молоко пастеризоване жирністю до 2,6% включно`, `йогурт`, `кефір`, `сметана жирністю до 15% включно`, `сметана з підвищеним вмістом жиру`, `крем-сир`,`сири тверді типу Едам`, `сири м’які жирні`, `масло вершкове 82%`, `масло вершкове спред`, 
                  `маргарин`, `молоко з підвищеним вмістом жиру`, `сири м’які нежирні`, `сири плавлені`,`сири розсольні`,`сирки та сиркова маса`, `молочні суміші для дитячого харчування`,
                  
                  ### Риба
                  `риба червона філе`,`риба річна`,`ікра червона`, `оселедці`,`скумбрія копчена`, `філе мороженої риби`,`риба морожена`, `консерви рибні в олії`,`морепродукти`,
                  
                  ### Яйця
                  `яйця курячі`,
                  
                  ### Олія, жири
                  `олія соняшникова`,`олія оливкова`,
                  
                  ### Напої безалкогольні
                  `сік яблучний`,`сік апельсиновий`,
                  
                  ### Кава і чай
                  `кава розчинна`, `кава мелена`, `чай у пакетиках`, 
                  
                  ### Напівфабрикати
                  `пельмені`, `вареники`,`крабові палички`,
                  
                  ### Консерви
                  `кукурудза консервована`, `горошок консервований`, `гриби консервовані`,
                  
                  ### Заморожені овочі
                  `броколі заморожена`, `шпінат заморожений`,
                  
                  ### Солодощі
                  `печиво здобне`, `печиво затяжне`, `шоколад`,`цукати`,`вафлі`,`мед`,`зефір`,`морозиво`,`карамель`,`цукерки шоколадні`,`торти`,
                  
                  ### Сухофрукти
                  `сухофрукти`,
                  
                  ### Безалкогольні напої
                  `солодка вода`,
                  
                  ### Алкоголь та цигарки
                  `пиво`, `вино біле сухе`, `вино червоне сухе`, `горілка`, `ром`, `віскі`, `шампанське`, `коньяк`, 
                  
                  ### Соуси
                  `томатна паста`, `кетчуп томатний`,`майонез`,`сіль`,
                  
                  ###Сигарети
                  `сигарети з фільтром медіум класу`, `сигарети з фільтром преміум класу`
   )
   
   
   
   type = vector %>% purrr::map(function(str){
      type1 = str_which(str, "TRUE")
      indices = (str %>% str_split(",") %>% unlist == "TRUE") %>% which
      categories_list[indices[1]]
   }) %>% unlist
}


detect_product_ru <- function(SECTION, PRODUCT) {
   ### Хліб
   `хліб цільнозерновий` = SECTION == "хлеб" & str_detect(PRODUCT, "цельнозерновой")
   `хліб пшеничний` = SECTION == "хлеб" & str_detect(PRODUCT, "пшеничн") & !str_detect(PRODUCT, "цельнозерн")  & !str_detect(PRODUCT, "ржан")
   `хліб житньо-пшеничний` = SECTION == "хлеб" & str_detect(PRODUCT, "\\bржан")
   `батон` = SECTION == "хлеб" & str_detect(PRODUCT, "батон")
   `багет` = SECTION == "хлеб" & str_detect(PRODUCT, "багет")
   
   ### фрукти
   `апельсини` =  SECTION == "фрукты" & str_detect(PRODUCT, "апельси(ни|н)\\b")
   `банани` = SECTION == "фрукты" & str_detect(PRODUCT, "^бана(ны|н)")
   `яблука` =  SECTION == "фрукты" & str_detect(PRODUCT, "ябл(о|у)к(а|о)")
   `авокадо` = SECTION == "фрукты" & str_detect(PRODUCT, "авокадо")
   `мандарини`= SECTION == "фрукты" & str_detect(PRODUCT, "мандарин")
   `виноград`= SECTION == "фрукты" & str_detect(PRODUCT, "виноград")
   `лимони`= SECTION == "фрукты" & str_detect(PRODUCT, "^лимон")
   `ягоди`= SECTION == "фрукты" & (str_detect(PRODUCT, "^голубика") | 
                                      str_detect(PRODUCT, "^малина") | 
                                      str_detect(PRODUCT, "^клубника")  | 
                                      str_detect(PRODUCT, "^смородина")) & !str_detect(PRODUCT, "морожен")
   `ківі` = SECTION == "фрукты" & str_detect(PRODUCT, "киви") & !str_detect(PRODUCT, "сушен")
   `кавуни`= SECTION == "фрукты" & str_detect(PRODUCT, "арбуз")
   
   
   
   ### овочі
   `буряк` = SECTION == "овощи" & str_detect(PRODUCT, "свекла\\b")
   `кабачки`  = SECTION == "овощи" & str_detect(PRODUCT, "кабач(ки|ок)\\b")
   `капуста білокачанна` = SECTION == "овощи" & str_detect(PRODUCT, "(К|к)апуста") & str_detect(PRODUCT, "белокач")
   `картопля` = SECTION == "овощи" & str_detect(PRODUCT, "картофель")
   `морква` = SECTION == "овощи" & str_detect(PRODUCT, "морковь")
   `огірки` = SECTION == "овощи" & str_detect(PRODUCT, "огурцы")
   `помідори` = SECTION == "овощи" & str_detect(PRODUCT, "помидоры")
   `цибуля` = SECTION == "овощи" & str_detect(PRODUCT, "лук")
   `часник` = SECTION == "овощи" & str_detect(PRODUCT, "чеснок")
   `гриби` = SECTION == "помидоры" & str_detect(PRODUCT, "шампиньон")
   `перець`= SECTION == "овощи" & str_detect(PRODUCT, "перец") & (str_detect(PRODUCT, "красный") | str_detect(PRODUCT, "капи") | str_detect(PRODUCT, "білозірка") )
   `баклажани` = SECTION == "овощи" & str_detect(PRODUCT, "баклажан")
   `салат` = SECTION == "Зелень" & str_detect(PRODUCT, "салат")
   
   
   ### мʼясо
   `свинина` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(С|с)вин") & str_detect(PRODUCT, "без кістки")
   `свинина гуляш` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(С|с)вин") & str_detect(PRODUCT, "(Г|г)уляш")
   `свинина фарш` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(С|с)вин") & str_detect(PRODUCT, "(Ф|a)арш")
   `свинина ребра` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(С|с)вин") & str_detect(PRODUCT, "(Р|р)ебра")
   `яловичина` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(Я|я)лович") & (str_detect(PRODUCT, "без кістки") | str_detect(PRODUCT, "(Ф|ф)іле") | str_detect(PRODUCT, "(С|с)тейк"))
   `яловичина фарш` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(Я|я)лович") & str_detect(PRODUCT, "(Ф|a)арш")
   `яловичина ребра` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(Я|я)лович") & str_detect(PRODUCT, "(Р|р)ебра")
   `філе куряче` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(К|к)ур") & str_detect(PRODUCT, "(Ф|ф)іле")
   `курка крильця` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\b(К|к)ур") & str_detect(PRODUCT, "\\b(К|к)рил")
   `курка стегно` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\b(К|к)ур") & str_detect(PRODUCT, "(С|с)тегн")
   `птиця (тушки курячі)` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\b(К|к)ур") & str_detect(PRODUCT, "(Т|т)ушка")
   `субпродукти яловичі` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(Я|я)лович") & (str_detect(PRODUCT, "(Н|н)ирки") | str_detect(PRODUCT, "(П|п)ечінк")| str_detect(PRODUCT, "(Л|л)егені")|str_detect(PRODUCT, "(C|c)ерце"))
   `субпродукти свинячі` = SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(С|с)вин") & (str_detect(PRODUCT, "(Н|н)ирки") | str_detect(PRODUCT, "(П|п)ечінк")| str_detect(PRODUCT, "(Л|л)егені")|str_detect(PRODUCT, "(C|c)ерце"))
   `субпродукти курячі`= SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(К|к)ур(яч|ин)") & (str_detect(PRODUCT, "(Н|н)ирки") | str_detect(PRODUCT, "(П|п)ечінк")| str_detect(PRODUCT, "(Л|л)егені")|str_detect(PRODUCT, "(C|c)ерце"))
   `сало`= SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(С|с)ало")
   `вирізка свиняча`= SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(С|с)вин") & str_detect(PRODUCT, "\\b(В|в)ирізка")
   `вирізка яловича`= SECTION == "свежее мясо" & str_detect(PRODUCT, "\\b(Я|я)лович") & str_detect(PRODUCT, "\\b(В|в)ирізка")
   
   ### Ковбаса та сосиски
   `сосиски в/ґ` = SECTION == "колбаса и сосиски" & (str_detect(PRODUCT, "(С|с)осиск") | str_detect(PRODUCT, "(С|с)ардель")) & (str_detect(PRODUCT, "в/(ґ|г)")| str_detect(PRODUCT, "вищ.*(ґ|г)ат"))
   `сосиски 1/ґ` = SECTION == "колбаса и сосиски" & (str_detect(PRODUCT, "(С|с)осиск") | str_detect(PRODUCT, "(С|с)ардель")) & str_detect(PRODUCT, "(перш|1/ґ)")
   `ковбаса варена в/ґ` = SECTION == "колбаса и сосиски" & str_detect(PRODUCT, "(К|к)овбаса.*варена") & str_detect(PRODUCT, "вищ.*(гат|сорт|ґатун)")
   `ковбаса варена 1/ґ` = SECTION == "колбаса и сосиски" & str_detect(PRODUCT, "(К|к)овбаса.*варена") & str_detect(PRODUCT, "(перш|1/ґ)")
   `ковбаси сирокопчені в/ґ`= SECTION == "колбаса и сосиски" & str_detect(PRODUCT, "(С|с)ирокопчен") & str_detect(PRODUCT, "(вищ|в/ґ)")
   `ковбаси варено-копчені в/ґ` = SECTION == "колбаса и сосиски" & str_detect(PRODUCT, "(варен)") & str_detect(PRODUCT, "копчен")
   
   ### М'ясні делікатеси
   `вироби з м’яса делікатесні` = SECTION == "мясные деликатесы" #& (str_detect(PRODUCT, "(Б|б)екон")|str_detect(PRODUCT, "(Х|х)амон")|str_detect(PRODUCT, "(Б|б)астурма"))
   
   ### Бакалія
   `пластівці вівсяні` = SECTION == "бакалея" & str_detect(PRODUCT, "вівсян")
   `рис` = SECTION == "бакалея" & str_detect(PRODUCT, "рис\\b") & str_detect(PRODUCT, "длиннозер") & str_detect(PRODUCT, "шлифов")
   `крупи гречані` = SECTION == "бакалея" & str_detect(PRODUCT, "греч")
   `борошно пшеничне` = SECTION == "бакалея" & str_detect(PRODUCT, "мука.*пшени") 
   `макарони` = SECTION == "бакалея" & str_detect(PRODUCT, "макарони")
   `цукор` = SECTION == "бакалея" & str_detect(PRODUCT, "сахар.*белый") 
   `сухі сніданки` = str_detect(PRODUCT, "(сух|готов) завтрак")
   `квасоля` = SECTION == "бакалея" & str_detect(PRODUCT, "\\bфасоль\\b")
   `пшоно`= SECTION == "бакалея" & str_detect(PRODUCT, "пшено")
   `крупи манні`= SECTION == "бакалея" & str_detect(PRODUCT, "манная")
   `крупи ячні`= SECTION == "бакалея" & str_detect(PRODUCT, "ячневая")
   `суп`= SECTION == "бакалея" & str_detect(PRODUCT, "\\b(С|с)уп\\b")
   
   
   ### Молочка
   `молоко пастеризоване жирністю до 2,6% включно` = SECTION == "молоко" & str_detect(PRODUCT, "ультрапастеризованное.*2(.|,)5%") 
   `йогурт` = SECTION == "йогурт" & str_detect(PRODUCT, "Йогурт") & !str_detect(PRODUCT, "(К|к)окосовый") & !str_detect(PRODUCT, "(С|с)оевый")
   `кефір` = SECTION == "кисломолочные напитки" & str_detect(PRODUCT, "кефир") & str_detect(PRODUCT, "2(.|,)5%")
   `сметана 10-15%` = SECTION == "сметана" & str_detect(PRODUCT, "сметана.*(10|15)%")
   `сметана 20+ %` = SECTION == "сметана" & str_detect(PRODUCT, "сметана.*(2[\\d]|3[\\d])%")
   `крем-сир` = SECTION == "сыр" & str_detect(PRODUCT, "(К|к)рем-сыр")
   `сири тверді типу Едам` = SECTION == "сыр" & str_detect(PRODUCT, "сыр") & (str_detect(PRODUCT, "\\bЕдам")|str_detect(PRODUCT, "\\bЧеддер")|str_detect(PRODUCT, "\\bГауда")) & !str_detect(PRODUCT, "плавлений")
   `сир кисломолочний жирний` = SECTION == "творог" & str_detect(PRODUCT, "творог") & str_detect(PRODUCT, "[6-9][0-9]{0,1},{0,1}[\\d]{0,1}%")
   `масло вершкове 82%` = SECTION == "масло и маргарин" & str_detect(PRODUCT, "масло.*сливочн.*82.*%")
   `масло вершкове спред` = SECTION == "масло и маргарин" & str_detect(PRODUCT, "масло.*7[\\d][,.]{0,1}[\\d]{0,1}%")
   `маргарин` = SECTION == "масло и маргарин" & str_detect(PRODUCT, "маргарин\\b.*7.*%")
   `молоко з підвищеним вмістом жиру ` = SECTION == "молоко" & str_detect(PRODUCT, "ультрапастеризованное.*3(.|,)[\\d]%") 
   `сир кисломолочний нежирний` = SECTION == "творог" & str_detect(PRODUCT, "творог") & str_detect(PRODUCT, "[0-5],{0,1}[\\d]{0,1}%")
   `плавлений сир` = SECTION == "сыр" & str_detect(PRODUCT, "сыр.*плавленый")
   `сири розсольні` = SECTION == "сыр" & (str_detect(PRODUCT, "(М|м)оцаре")| str_detect(PRODUCT, "(С|с)улугун")| str_detect(PRODUCT, "фета\\b")| str_detect(PRODUCT, "бр(ы|и)нза"))
   `сирки та сиркова маса`= SECTION == "творог" & (str_detect(PRODUCT, "маса") | str_detect(PRODUCT, "сырок"))
   `молочні суміші для дитячого харчування` = SECTION == "био товары" & str_detect(PRODUCT, "молочная") & str_detect(PRODUCT, "смесь")
   
   ### риба
   `риба червона філе` = SECTION == "свежая рыба" & (str_detect(PRODUCT, "лосось") | str_detect(PRODUCT, "сьомга") | str_detect(PRODUCT, "форель")) & str_detect(PRODUCT, "((Ф|ф)іле|(С|с)тейк|\\bціл)")
   `риба річна` = SECTION == "свежая рыба" & (str_detect(PRODUCT, "(Т|т)овстолоб") | str_detect(PRODUCT, "(К|к)ороп"))
   `ікра червона` = SECTION == "морепродукты" & str_detect(PRODUCT, "(и|і)кра.*лосос") & !str_detect(PRODUCT, "белковая") & !str_detect(PRODUCT, "імітован")
   `оселедці` = SECTION == "приготовленная рыба" & str_detect(PRODUCT, "(О|о)селедець")
   `скумбрія копчена` = SECTION == "приготовленная рыба" & str_detect(PRODUCT, "скумбр(и|і)я") & str_detect(PRODUCT, "копчен")
   `філе мороженої риби` = SECTION == "риба" & str_detect(PRODUCT, "филе") & str_detect(PRODUCT, "морож")
   `риба морожена` = SECTION == "рыба" & str_detect(PRODUCT, "мороже") & !str_detect(PRODUCT, "филе") & !str_detect(PRODUCT, "фарш")
   `консерви рибні в олії`= SECTION == "консервированное мясо и рыба" & str_detect(PRODUCT, "в масле")
   `морепродукти`= SECTION == "морепродукты" & !str_detect(PRODUCT, "(и|і)кра") & !str_detect(PRODUCT, "краб.*палоч")
   
   ### Яйця
   `яйця курячі` = SECTION == "яйца" & str_detect(PRODUCT, "курин")
   
   ### Олія
   `олія соняшникова` = SECTION == "масло и уксус" & str_detect(PRODUCT, "подсолнечное")
   `олія оливкова` = SECTION == "масло и уксус" & str_detect(PRODUCT, "оливковое")
   
   ### Безалкогольні напої
   `сік яблучний` = SECTION == "сок" & str_detect(PRODUCT, " яблочний")
   `сік апельсиновий` = SECTION == "сок" & str_detect(PRODUCT, " апельсиновый")
   
   ### Кава і чай
   `кава розчинна` = SECTION == "кофе" & str_detect(PRODUCT, "растворимый") & !str_detect(PRODUCT, "3в1")
   `кава мелена` = SECTION == "кофе" & str_detect(PRODUCT, "молотый")
   `чай у пакетиках` = SECTION == "чай" & str_detect(PRODUCT, "пакетиках") & str_detect(PRODUCT, "25")
   
   ### Напівфабрикати
   `пельмені` = SECTION == "полуфабрикаты" & str_detect(PRODUCT, "пельмени")
   `вареники` =  SECTION == "полуфабрикаты" & str_detect(PRODUCT, "вареники") & str_detect(PRODUCT, "(картошк|картопл)")
   `крабові палички` = SECTION == "полуфабрикаты" & str_detect(PRODUCT, "крабов")& str_detect(PRODUCT, "палочки") 
   
   ### Консерви
   `кукурудза консервована` = SECTION == "консервированные фрукты и овощи" & str_detect(PRODUCT, "кукуруза")
   `горошок консервований` = SECTION == "консервированные фрукты и овощи" & str_detect(PRODUCT, "горошок")
   `гриби консервовані` = SECTION == "консервированные фрукты и овощи" & (str_detect(PRODUCT, "грибы")| str_detect(PRODUCT, "шамп") | str_detect(PRODUCT, "маслюки"))
   
   ### Заморожені овочі
   `броколі заморожена` = SECTION == "овощи и грибы" & str_detect(PRODUCT, "брокколи") & str_detect(PRODUCT, "заморож")
   `шпінат заморожений` = SECTION == "овощи и грибы" & str_detect(PRODUCT, "шпинат") & str_detect(PRODUCT, "заморож")
   
   ### Солодощі
   `печиво здобне` = SECTION == "печенье, кексы, пирожные" & str_detect(PRODUCT, "(П|п)ечиво") & str_detect(PRODUCT, "(З|з)добне")
   `печиво затяжне` = SECTION == "печенье, кексы, пирожные" & str_detect(PRODUCT, "(П|п)ечиво") & str_detect(PRODUCT, "(З|з)атяжне")
   `шоколад чорний` = SECTION == "шоколад, конфеты, жвачки" & str_detect(PRODUCT, "(Ш|ш)околад") & str_detect(PRODUCT, "черний")
   `цукати`= SECTION == "сухофрукты" & str_detect(PRODUCT, "(Ц|ц)укати")
   `вафлі` = SECTION == "печенье, кексы, пирожные" & str_detect(PRODUCT, "вафли")
   `мед`= SECTION == "джем и мед" & str_detect(PRODUCT, "^Мед\\b")
   `зефір` = SECTION == "шоколад, конфеты, жвачки" & str_detect(PRODUCT, "зефир")
   `морозиво` = str_detect(SECTION, "мороженое")
   `карамель` = SECTION == "шоколад, конфеты, жвачки" & str_detect(PRODUCT, "карамель")
   `цукерки шоколадні` = SECTION == "Кондитерські вироби" & str_detect(PRODUCT, "конфеты") & str_detect(PRODUCT, "шоколадные")
   `торти` = SECTION == "торты и пирожные" & str_detect(PRODUCT, "торт\\b")
   
   # 
   
   ### Сухофрукти
   `сухофрукти` = SECTION == "сухофрукты" & (str_detect(PRODUCT, "курага")| 
                                                str_detect(PRODUCT, "абрикос")| 
                                                str_detect(PRODUCT, "чернослив")| 
                                                str_detect(PRODUCT, "изюм")| 
                                                str_detect(PRODUCT, "клюква")
   )
   ### Безалкогольні напої
   `солодка вода` = SECTION == "сладкая вода"
   
   ### Алкоголь та цигарки
   `пиво` = str_detect(PRODUCT, "\\bпиво\\b")
   `вино біле сухе` = str_detect(PRODUCT, "вино") & str_detect(PRODUCT, "\\bсухое") & str_detect(PRODUCT, "белое")
   `вино червоне сухе` = str_detect(PRODUCT, "вино") & str_detect(PRODUCT, "\\bсухое") & str_detect(PRODUCT, "красное")
   `горілка` = str_detect(PRODUCT, "водка")
   `ром` = str_detect(PRODUCT, "\\bром\\b")
   `віскі` = str_detect(PRODUCT, "\\bвиски\\b")
   `шампанське` = str_detect(PRODUCT, "шампанское")
   `коньяк` = str_detect(PRODUCT, "коньяк")
   
   ### Соуси
   `томатна паста` = SECTION == "соусы и специи" & str_detect(PRODUCT, "томатна") & str_detect(PRODUCT, "паста")
   `кетчуп томатний`= SECTION == "соусы и специи" & str_detect(PRODUCT, "кетчуп")
   `майонез`= SECTION == "соусы и специи"  & str_detect(PRODUCT, "майонез")
   `сіль`= SECTION == "соусы и специи" & str_detect(PRODUCT, "\\bсоль\\b")
   
   
   `сигарети з фільтром медіум класу` = SECTION == "Цигарки" & str_detect(PRODUCT, "Bond|L&M|Winston") 
   `сигарети з фільтром преміум класу` = SECTION == "Цигарки" & str_detect(PRODUCT, "Kent|Camel з фільтром") 
   
   # тут усе повинно бути в тому самому порядку що і у religions_list
   vector = str_c(sep=",", 
                  ### Хліб
                  `хліб цільнозерновий`,`хліб пшеничний`,`хліб житньо-пшеничний`,`батон`,`багет`,
                  
                  ### Фрукти
                  `апельсини`, `банани`, `яблука`, `авокадо`, `мандарини`, `виноград`,`лимони`,`ягоди`,`ківі`,`кавуни`,
                  
                  ### Овочі
                  `буряк`, `кабачки`, `капуста білокачанна`, `картопля`, `морква`, `огірки`, `помідори`, `цибуля`, `часник`, `гриби`,`перець`,`баклажани`,`салат`,
                  
                  ### Мʼясо
                  `свинина`, `свинина гуляш`, `свинина фарш`, `свинина ребра`, `яловичина`, `яловичина фарш`, `яловичина ребра`, 
                  `філе куряче`, `курка крильця`, `курка стегно`,`птиця (тушки курячі)`,`субпродукти яловичі`,`субпродукти свинячі`,`субпродукти курячі`,`сало`,`вирізка свиняча`,
                  `вирізка яловича`,
                  
                  ### Ковбаси
                  `сосиски в/ґ`,`сосиски 1/ґ`, `ковбаса варена в/ґ`,`ковбаса варена 1/ґ`,`ковбаси сирокопчені в/ґ`,`ковбаси варено-копчені в/ґ`,
                  
                  ### Мʼясні делікатеси
                  `вироби з м’яса делікатесні`,
                  
                  ### Бакалія
                  `пластівці вівсяні`, `рис`, `крупи гречані`, `борошно пшеничне`,`макарони`,`цукор`, `сухі сніданки`, `квасоля`,`пшоно`,`крупи манні`,`крупи ячні`,`суп`,
                  
                  ### Молочка
                  `молоко пастеризоване жирністю до 2,6% включно`, `йогурт`, `кефір`, `сметана 10-15%`, `сметана 20+ %`, `крем-сир`,`сири тверді типу Едам`, `сир кисломолочний жирний`, `масло вершкове 82%`, `масло вершкове спред`, 
                  `маргарин`, `молоко з підвищеним вмістом жиру`, `сир кисломолочний нежирний`, `плавлений сир`,`сири розсольні`,`сирки та сиркова маса`, `молочні суміші для дитячого харчування`,
                  
                  ### Риба
                  `риба червона філе`,`риба річна`,`ікра червона`, `оселедці`,`скумбрія копчена`, `філе мороженої риби`,`риба морожена`, `консерви рибні в олії`,`морепродукти`,
                  
                  ### Яйця
                  `яйця курячі`,
                  
                  ### Олія, жири
                  `олія соняшникова`,`олія оливкова`,
                  
                  ### Напої безалкогольні
                  `сік яблучний`,`сік апельсиновий`,
                  
                  ### Кава і чай
                  `кава розчинна`, `кава мелена`, `чай у пакетиках`, 
                  
                  ### Напівфабрикати
                  `пельмені`, `вареники`,`крабові палички`,
                  
                  ### Консерви
                  `кукурудза консервована`, `горошок консервований`, `гриби консервовані`,
                  
                  ### Заморожені овочі
                  `броколі заморожена`, `шпінат заморожений`,
                  
                  ### Солодощі
                  `печиво здобне`, `печиво затяжне`, `шоколад чорний`,`цукати`,`вафлі`,`мед`,`зефір`,`морозиво`,`карамель`,`цукерки шоколадні`,`торти`,
                  
                  ### Сухофрукти
                  `сухофрукти`,
                  
                  ### Безалкогольні напої
                  `солодка вода`,
                  
                  ### Алкоголь та цигарки
                  `пиво`, `вино біле сухе`, `вино червоне сухе`, `горілка`, `ром`, `віскі`, `шампанське`, `коньяк`, 
                  
                  ### Соуси
                  `томатна паста`, `кетчуп томатний`,`майонез`,`сіль`,
                  
                  ###Сигарети
                  `сигарети з фільтром медіум класу`, `сигарети з фільтром преміум класу`
   )
   
   
   
   type = vector %>% purrr::map(function(str){
      type1 = str_which(str, "TRUE")
      indices = (str %>% str_split(",") %>% unlist == "TRUE") %>% which
      categories_list[indices[1]]
   }) %>% unlist
}

